#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_download_file.debian_12_cloud_image: Refreshing state... [id=local:iso/debian_12_cloud_image.img]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image has been deleted
  - resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      - id             = "local:iso/debian_12_cloud_image.img" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      + content_type   = "iso"
      + datastore_id   = "local"
      + file_name      = "debian_12_cloud_image.img"
      + id             = (known after apply)
      + node_name      = "pve"
      + overwrite      = true
      + size           = (known after apply)
      + upload_timeout = 600
      + url            = "https://cloud.debian.org/images/cloud/bookworm/latest/debian-12-generic-amd64.qcow2"
      + verify         = true
    }

  # proxmox_virtual_environment_vm.debian_vm will be created
  + resource "proxmox_virtual_environment_vm" "debian_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "dev"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 100

      + cpu {
          + architecture = "x86_64"
          + cores        = 2
          + hotplugged   = 0
          + limit        = 0
          + numa         = false
          + sockets      = 1
          + type         = "host"
          + units        = 1024
        }

      + disk {
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 128
          + ssd               = true
        }

      + initialization {
          + datastore_id = "local-zfs"

          + dns {
              + servers = [
                  + "192.168.10.1",
                ]
            }

          + ip_config {
              + ipv4 {
                  + address = "192.168.10.100/24"
                  + gateway = "192.168.10.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ecdsa-sha2-nistp521 AAAAE2VjZHNhLXNoYTItbmlzdHA1MjEAAAAIbmlzdHA1MjEAAACFBAEC7fki9UNyuFGcNNeAOGCbUXxf/w+JGkKp7BR68gMTNmMYBE4/x+naDqJgajJElPuAYJaI715XBgKAOg+gwce2vwB9+XzRPCClEo6zZB56HugAVpnkje9PpdYJS6tattzD/56ofFDQltXVdYAuE49eOBNoyiD9I9y20inXkVJuEg5PCw==",
                ]
              + password = (sensitive value)
              + username = "devops"
            }
        }

      + memory {
          + dedicated = 4096
          + floating  = 0
          + shared    = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 10
        }

      + serial_device {
          + device = "socket"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: The file does not exist in datastore and resource must be recreated.

  with proxmox_virtual_environment_download_file.debian_12_cloud_image,
  on debian.tf line 128, in resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image":
 128: resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {

file does not exists in datastore

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*